security updates and notebook
